修复一些bug，更新readme
